# 판다스(pandas)
+ 파이썬에서 사용하는 데이터분석 라이브러리

+ 행과 열로 이루어진 데이터 객체를 만들어 다룰 수 있게 되며 보다 안정적으로 대용량의 데이터들을 처리하는데 매우 편리한 도구

+ NumPy를 기반으로 구축되었으며 과학 컴퓨팅 환경 내에서 다른 많은 타사 라이브러리와 잘 통합되도록 설계

In [1]:
import pandas as pd


##DataFrame
+ 2차원 자료구조인 DataFrame는 행과 열이 있는 테이블 데이터
+ 딕션너리를 데이터 프레임으로 변경
 - 딕션너리 키 : 열(column)
 - 딕션너리 값 : 행(row)

In [ ]:
df = pd.read_csv('/content/drive/My Drive/PythonWork/PythonBasic/04/부산쓰레기발생2017년.csv', engine='python', encoding='CP949')
df

In [4]:
df.columns = [item.strip() for item in df.columns]
df.columns

Index(['항목', '구분', '중구', '서구', '동구', '영도구', '부산진구', '동래구', '남구', '북구', '해운대구',
       '사하구', '금정구', '강서구', '연제구', '수영구', '사상구', '기장군'],
      dtype='object')

In [5]:
df.head(2)

      항목     구분    중구    서구    동구   영도구  ...   금정구   강서구   연제구   수영구   사상구   기장군
0  매립처리량  연간(톤)  3034  2323  1653  1219  ...  7240  9742  1831  2205  9937  2290
1  매립처리량  일일(톤)     8     7     5     3  ...    20    27     5     6    27     6

[2 rows x 18 columns]

####**N행 확인하기**
+ .head(N) 
  - 데이터프레임의 상위 N개의 행을 출력
  - N생략하면 5개 
+ .tail(N)  
 - 하위 N개의 행을 출력

In [ ]:
df.head()

       항목     구분     중구     서구     동구  ...    강서구    연제구    수영구    사상구    기장군
0   매립처리량  연간(톤)   3034   2323   1653  ...   9742   1831   2205   9937   2290
1   매립처리량  일일(톤)      8      7      5  ...     27      5      6     27      6
2   소각처리량  연간(톤)  13729  10446   8297  ...   4788  14521  11987    216  13687
3   소각처리량  일일(톤)     38     29     23  ...     13     40     33      0     37
4  재활용처리량  연간(톤)   9082  21301  17968  ...  25977  37115  28135  57110  15170

[5 rows x 18 columns]

In [ ]:
df.head(2)

      항목     구분    중구    서구    동구   영도구  ...   금정구   강서구   연제구   수영구   사상구   기장군
0  매립처리량  연간(톤)  3034  2323  1653  1219  ...  7240  9742  1831  2205  9937  2290
1  매립처리량  일일(톤)     8     7     5     3  ...    20    27     5     6    27     6

[2 rows x 18 columns]

In [ ]:
df.tail(2)

        항목     구분    중구    서구    동구  ...    강서구    연제구    수영구    사상구    기장군
6  음식물류발생량  연간(톤)  5154  8779  6399  ...  10810  14122  13289  24161  16648
7  음식물류발생량  일일(톤)    14    24    18  ...     30     39     36     66     46

[2 rows x 18 columns]

####**정보 확인하기**
+ .shape 속성
 - (행, 열) 크기를 확인하기
 - 행의 개수 : len(데이터프레임), len(.index), .shape[0]
 - 열의 개수 : len(.column), .shape[1]

In [6]:
df.shape

(8, 18)

In [ ]:
#행의 개수
print(df.shape[0])
print(len(df))
print(len(df.index))

8
8
8

In [ ]:
#열의 개수
print(df.shape[1]) 
print(len(df.columns))

18
18

+ .info()
 - 데이터프레임에 대한 전반적인 정보
 - 데이터프레임을 구성하는 행과 열의 크기, 컬럼명, 컬럼을 구성하는 값의 자료형 등을 출력

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 18 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   항목      8 non-null      object
 1   구분      8 non-null      object
 2   중구      8 non-null      int64
 3   서구      8 non-null      int64
 4   동구      8 non-null      int64
 5   영도구     8 non-null      int64
 6   부산진구    8 non-null      int64
 7   동래구     8 non-null      int64
 8   남구      8 non-null      int64
 9   북구      8 non-null      int64
 10  해운대구    8 non-null      int64
 11  사하구     8 non-null      int64
 12  금정구     8 non-null      int64
 13  강서구     8 non-null      int64
 14  연제구     8 non-null      int64
 15  수영구     8 non-null      int64
 16  사상구     8 non-null      int64
 17  기장군     8 non-null      int64
dtypes: int64(16), object(2)
memory usage: 1.2+ KB

In [9]:
df.dtypes

항목      object
구분      object
중구       int64
서구       int64
동구       int64
영도구      int64
부산진구     int64
동래구      int64
남구       int64
북구       int64
해운대구     int64
사하구      int64
금정구      int64
강서구      int64
연제구      int64
수영구      int64
사상구      int64
기장군      int64
dtype: object

+ .count()
 - Null이 아닌 행의 개수 확인
 - axis='columns' : Null이 아닌 열의 개수 확인

In [ ]:
df.count()

항목      8
구분      8
중구      8
서구      8
동구      8
영도구     8
부산진구    8
동래구     8
남구      8
북구      8
해운대구    8
사하구     8
금정구     8
강서구     8
연제구     8
수영구     8
사상구     8
기장군     8
dtype: int64

In [8]:
df.count(axis=1)

0    18
1    18
2    18
3    18
4    18
5    18
6    18
7    18
dtype: int64

####**값이 나온 횟수**
+ .value_counts() 
 - 개별 컬럼 내에 각각의 값이 나온 횟수
 - normalize 옵션 : % 로도 표현

In [ ]:
df['구분'].value_counts()

일일(톤)    4
연간(톤)    4
Name: 구분, dtype: int64

In [10]:
g = df['구분']
print(type(g))
print(g)

<class 'pandas.core.series.Series'>
0    연간(톤)
1    일일(톤)
2    연간(톤)
3    일일(톤)
4    연간(톤)
5    일일(톤)
6    연간(톤)
7    일일(톤)
Name: 구분, dtype: object

In [11]:
g = g.drop_duplicates()
g

0    연간(톤)
1    일일(톤)
Name: 구분, dtype: object

In [13]:
df['구분'].value_counts(normalize = True)

일일(톤)    0.5
연간(톤)    0.5
Name: 구분, dtype: float64

####**요약 통계량 확인**
+ .describe()
 - 데이터프레임의 열별 요약 통계량
 - sum(),mean(), max(), median()등 개별 함수를 사용가능

In [14]:
df.sum()

항목      매립처리량매립처리량소각처리량소각처리량재활용처리량재활용처리량음식물류발생량음식물류발생량
구분            연간(톤)일일(톤)연간(톤)일일(톤)연간(톤)일일(톤)연간(톤)일일(톤)
중구                                               31084
서구                                               42967
동구                                               34412
영도구                                              44129
부산진구                                            133869
동래구                                              86101
남구                                               81893
북구                                               98945
해운대구                                            142273
사하구                                             128215
금정구                                              85121
강서구                                              51458
연제구                                              67775
수영구                                              55768
사상구                                              91673
기장군                                              47926
dtype: object

In [ ]:
df.mean()

중구       3885.500
서구       5370.875
동구       4301.500
영도구      5516.125
부산진구    16733.625
동래구     10762.625
남구      10236.625
북구      12368.125
해운대구    17784.125
사하구     16026.875
금정구     10640.125
강서구      6432.250
연제구      8471.875
수영구      6971.000
사상구     11459.125
기장군      5990.750
dtype: float64

In [ ]:
dfyear = df[df['구분'] == '연간(톤)']
dfyear

        항목     구분     중구     서구     동구  ...    강서구    연제구    수영구    사상구    기장군
0    매립처리량  연간(톤)   3034   2323   1653  ...   9742   1831   2205   9937   2290
2    소각처리량  연간(톤)  13729  10446   8297  ...   4788  14521  11987    216  13687
4   재활용처리량  연간(톤)   9082  21301  17968  ...  25977  37115  28135  57110  15170
6  음식물류발생량  연간(톤)   5154   8779   6399  ...  10810  14122  13289  24161  16648

[4 rows x 18 columns]

In [ ]:
dfyear.describe()

                 중구            서구  ...           사상구           기장군
count      4.000000      4.000000  ...      4.000000      4.000000
mean    7749.750000  10712.250000  ...  22856.000000  11948.750000
std     4708.238763   7880.555961  ...  24863.022758   6551.650346
min     3034.000000   2323.000000  ...    216.000000   2290.000000
25%     4624.000000   7165.000000  ...   7506.750000  10837.750000
50%     7118.000000   9612.500000  ...  17049.000000  14428.500000
75%    10243.750000  13159.750000  ...  32398.250000  15539.500000
max    13729.000000  21301.000000  ...  57110.000000  16648.000000

[8 rows x 16 columns]

####**시리즈 내에 유일한 값 확인**
+ .unique() 
 - 개별 컬럼 내에 유일한 값을 확인

In [ ]:
df['구분'].unique()

array(['연간(톤)', '일일(톤)'], dtype=object)

In [ ]:
df['금정구'].unique()

array([ 7240,    20,   222,     1, 56153,   154, 21273,    58])

## **데이터프레임 슬라이싱**
+ .loc[행인덱싱, 열인덱싱]
+ .iloc[행순서번호, 열순서번호]

In [ ]:
df2 = df.set_index('항목')
df2

#### **.loc : 인덱싱으로 추출**

In [19]:
df2

            구분     중구     서구     동구    영도구  ...    강서구    연제구    수영구    사상구    기장군
항목                                          ...
매립처리량    연간(톤)   3034   2323   1653   1219  ...   9742   1831   2205   9937   2290
매립처리량    일일(톤)      8      7      5      3  ...     27      5      6     27      6
소각처리량    연간(톤)  13729  10446   8297   8651  ...   4788  14521  11987    216  13687
소각처리량    일일(톤)     38     29     23     24  ...     13     40     33      0     37
재활용처리량   연간(톤)   9082  21301  17968  24616  ...  25977  37115  28135  57110  15170
재활용처리량   일일(톤)     25     58     49     68  ...     71    102     77    156     42
음식물류발생량  연간(톤)   5154   8779   6399   9522  ...  10810  14122  13289  24161  16648
음식물류발생량  일일(톤)     14     24     18     26  ...     30     39     36     66     46

[8 rows x 17 columns]

In [16]:
df2.index

Index(['매립처리량', '매립처리량', '소각처리량', '소각처리량', '재활용처리량', '재활용처리량', '음식물류발생량',
       '음식물류발생량'],
      dtype='object', name='항목')

In [17]:
df2.columns

Index(['구분', '중구', '서구', '동구', '영도구', '부산진구', '동래구', '남구', '북구', '해운대구', '사하구',
       '금정구', '강서구', '연제구', '수영구', '사상구', '기장군'],
      dtype='object')

In [21]:
y1 = df2.loc[:, '영도구']
y2 = df2.loc[:, ['영도구']]

In [22]:
print(type(y1))
print(type(y2))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [18]:
#행추출
df2.loc['매립처리량', :]

          구분    중구    서구    동구   영도구   부산진구  ...   금정구   강서구   연제구   수영구   사상구   기장군
항목                                           ...
매립처리량  연간(톤)  3034  2323  1653  1219  17393  ...  7240  9742  1831  2205  9937  2290
매립처리량  일일(톤)     8     7     5     3     48  ...    20    27     5     6    27     6

[2 rows x 17 columns]

In [ ]:
df2.loc[['매립처리량','재활용처리량'], :]

           구분    중구     서구     동구    영도구  ...    강서구    연제구    수영구    사상구    기장군
항목                                        ...
매립처리량   연간(톤)  3034   2323   1653   1219  ...   9742   1831   2205   9937   2290
매립처리량   일일(톤)     8      7      5      3  ...     27      5      6     27      6
재활용처리량  연간(톤)  9082  21301  17968  24616  ...  25977  37115  28135  57110  15170
재활용처리량  일일(톤)    25     58     49     68  ...     71    102     77    156     42

[4 rows x 17 columns]

In [ ]:
#열추출
df2.loc[:, '금정구']

항목
매립처리량       7240
매립처리량         20
소각처리량        222
소각처리량          1
재활용처리량     56153
재활용처리량       154
음식물류발생량    21273
음식물류발생량       58
Name: 금정구, dtype: int64

In [ ]:
df2.loc[:, ['구분','금정구']]

            구분    금정구
항목
매립처리량    연간(톤)   7240
매립처리량    일일(톤)     20
소각처리량    연간(톤)    222
소각처리량    일일(톤)      1
재활용처리량   연간(톤)  56153
재활용처리량   일일(톤)    154
음식물류발생량  연간(톤)  21273
음식물류발생량  일일(톤)     58

In [ ]:
df2.loc[['매립처리량','재활용처리량'], ['구분','금정구']]

           구분    금정구
항목
매립처리량   연간(톤)   7240
매립처리량   일일(톤)     20
재활용처리량  연간(톤)  56153
재활용처리량  일일(톤)    154

#### **.iloc : 순서번호로 추출**

In [23]:
df2.index

Index(['매립처리량', '매립처리량', '소각처리량', '소각처리량', '재활용처리량', '재활용처리량', '음식물류발생량',
       '음식물류발생량'],
      dtype='object', name='항목')

In [ ]:
#행추출
df2.iloc[:2, :]

          구분    중구    서구    동구   영도구   부산진구  ...   금정구   강서구   연제구   수영구   사상구   기장군
항목                                           ...
매립처리량  연간(톤)  3034  2323  1653  1219  17393  ...  7240  9742  1831  2205  9937  2290
매립처리량  일일(톤)     8     7     5     3     48  ...    20    27     5     6    27     6

[2 rows x 17 columns]

In [ ]:
df2.iloc[[0,1,4,5], :]

           구분    중구     서구     동구    영도구  ...    강서구    연제구    수영구    사상구    기장군
항목                                        ...
매립처리량   연간(톤)  3034   2323   1653   1219  ...   9742   1831   2205   9937   2290
매립처리량   일일(톤)     8      7      5      3  ...     27      5      6     27      6
재활용처리량  연간(톤)  9082  21301  17968  24616  ...  25977  37115  28135  57110  15170
재활용처리량  일일(톤)    25     58     49     68  ...     71    102     77    156     42

[4 rows x 17 columns]

In [ ]:
df2.iloc[[0:2]]

SyntaxError: ignored

In [ ]:
#열추출
df2.iloc[:, 11]

항목
매립처리량       7240
매립처리량         20
소각처리량        222
소각처리량          1
재활용처리량     56153
재활용처리량       154
음식물류발생량    21273
음식물류발생량       58
Name: 금정구, dtype: int64

In [ ]:
df2.iloc[:, [0,11]]

            구분    금정구
항목
매립처리량    연간(톤)   7240
매립처리량    일일(톤)     20
소각처리량    연간(톤)    222
소각처리량    일일(톤)      1
재활용처리량   연간(톤)  56153
재활용처리량   일일(톤)    154
음식물류발생량  연간(톤)  21273
음식물류발생량  일일(톤)     58

In [ ]:
df2.iloc[[0,1,4,5], [0,11]]

           구분    금정구
항목
매립처리량   연간(톤)   7240
매립처리량   일일(톤)     20
재활용처리량  연간(톤)  56153
재활용처리량  일일(톤)    154



---
해결문제) 부산시기온.csv파일을 읽어서 2018년 최고, 최저 기온을 추출하고 통계량을 표시하시오.


---

In [24]:
dfbusan = pd.read_csv('/content/drive/My Drive/PythonWork/PythonBasic/04/부산시기온.csv',engine='python')
dfbusan

            일시    평균    최고    최저
0   2017-01-01   4.1  15.1  -7.7
1   2017-02-01   5.5  17.7  -5.7
2   2017-03-01   9.0  18.1  -2.3
3   2017-04-01  15.0  23.2   5.0
4   2017-05-01  19.0  28.2  12.8
5   2017-06-01  21.3  30.4  15.4
6   2017-07-01  26.1  32.7  21.2
7   2017-08-01  27.0  36.2  18.7
8   2017-09-01  22.6  29.7  14.5
9   2017-10-01  18.1  28.7   7.3
10  2017-11-01  11.2  23.6  -1.0
11  2017-12-01   3.6  14.5  -6.1
12  2018-01-01   1.9  14.0  -9.9
13  2018-02-01   3.9  14.7  -9.6
14  2018-03-01  10.0  22.3  -0.7
15  2018-04-01  14.5  24.3   3.0
16  2018-05-01  17.8  26.6   9.8
17  2018-06-01  21.5  31.3  15.1
18  2018-07-01  26.7  35.4  17.8
19  2018-08-01  27.9  36.4  21.2
20  2018-09-01  21.9  30.0  14.9
21  2018-10-01  16.4  25.6   7.9
22  2018-11-01  12.4  22.5   2.7
23  2018-12-01   5.7  18.8  -7.1
24  2019-01-01   4.5  13.7  -4.4
25  2019-02-01   6.6  16.5  -4.2
26  2019-03-01  10.5  21.0   0.5
27  2019-04-01  13.4  23.4   2.1
28  2019-05-01  19.3  30.1  11.0
29  2019-06-01  21.1  29.7  15.5

In [25]:
dfbusan.columns

Index(['일시', '평균', '최고', '최저'], dtype='object')

In [26]:
dfbusan.index

RangeIndex(start=0, stop=30, step=1)

In [ ]:
dfbusan = dfbusan.loc[12:23, ['일시','최고','최저']]
dfbusan

            일시    최고    최저
12  2018-01-01  14.0  -9.9
13  2018-02-01  14.7  -9.6
14  2018-03-01  22.3  -0.7
15  2018-04-01  24.3   3.0
16  2018-05-01  26.6   9.8
17  2018-06-01  31.3  15.1
18  2018-07-01  35.4  17.8
19  2018-08-01  36.4  21.2
20  2018-09-01  30.0  14.9
21  2018-10-01  25.6   7.9
22  2018-11-01  22.5   2.7
23  2018-12-01  18.8  -7.1

In [ ]:
dfbusan.describe()

              최고         최저
count  12.000000  12.000000
mean   25.158333   5.425000
std     7.292519  10.782741
min    14.000000  -9.900000
25%    21.425000  -2.300000
50%    24.950000   5.450000
75%    30.325000  14.950000
max    36.400000  21.200000

In [29]:
dfb = dfbusan
dfb.head(2)

           일시   평균    최고   최저
0  2017-01-01  4.1  15.1 -7.7
1  2017-02-01  5.5  17.7 -5.7

In [31]:
dfb = dfb.set_index('일시')
dfb.head(2)

             평균    최고   최저
일시
2017-01-01  4.1  15.1 -7.7
2017-02-01  5.5  17.7 -5.7

In [33]:
dfb.index.str.contains('2018')

array([False, False, False, False, False, False, False, False, False,
       False, False, False,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True, False, False, False,
       False, False, False])

In [34]:
dfb = dfb.loc[dfb.index.str.contains('2018'), :]

In [36]:
dfb = dfb.reset_index()
dfb

            일시    평균    최고    최저
0   2018-01-01   1.9  14.0  -9.9
1   2018-02-01   3.9  14.7  -9.6
2   2018-03-01  10.0  22.3  -0.7
3   2018-04-01  14.5  24.3   3.0
4   2018-05-01  17.8  26.6   9.8
5   2018-06-01  21.5  31.3  15.1
6   2018-07-01  26.7  35.4  17.8
7   2018-08-01  27.9  36.4  21.2
8   2018-09-01  21.9  30.0  14.9
9   2018-10-01  16.4  25.6   7.9
10  2018-11-01  12.4  22.5   2.7
11  2018-12-01   5.7  18.8  -7.1

In [39]:
dfb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      12 non-null     object
 1   평균      12 non-null     float64
 2   최고      12 non-null     float64
 3   최저      12 non-null     float64
dtypes: float64(3), object(1)
memory usage: 512.0+ bytes

In [38]:
dfb['일시'].str.contains('2018')

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
Name: 일시, dtype: bool

#### 데이터 유형 확인 
+ 데이터프레임.dtypes : 각열의 유형을 알려줌

In [41]:
df = dfbusan
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      30 non-null     object
 1   평균      30 non-null     float64
 2   최고      30 non-null     float64
 3   최저      30 non-null     float64
dtypes: float64(3), object(1)
memory usage: 1.1+ KB

In [42]:
df.dtypes

일시     object
평균    float64
최고    float64
최저    float64
dtype: object

+ 열시리즈.astype() : 특정 유형으로 변경
 - .astype(float64) , .astype(float32) , .astype(float16), .astype(int)
 - .astype(str)

In [44]:
df.head(2)

           일시   평균    최고   최저
0  2017-01-01  4.1  15.1 -7.7
1  2017-02-01  5.5  17.7 -5.7

In [46]:
df['차이'] = df['최고'] - df['최저']
df.head(2)

           일시   평균    최고   최저    차이
0  2017-01-01  4.1  15.1 -7.7  22.8
1  2017-02-01  5.5  17.7 -5.7  23.4

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      30 non-null     object
 1   평균      30 non-null     float64
 2   최고      30 non-null     float64
 3   최저      30 non-null     float64
 4   차이      30 non-null     float64
dtypes: float64(4), object(1)
memory usage: 1.3+ KB

In [48]:
df['차이'] = df['차이'].astype(int)
df.dtypes

일시     object
평균    float64
최고    float64
최저    float64
차이      int64
dtype: object

In [49]:
df.head(2)

           일시   평균    최고   최저  차이
0  2017-01-01  4.1  15.1 -7.7  22
1  2017-02-01  5.5  17.7 -5.7  23

+ pd.to_numeric() : 숫자 유형으로 변경
 - errors 매개 변수 
 - errors='ignore' : 무시
 - errors='coerce' : NaN

In [50]:
lt = ['1','2','a']
df2 = pd.DataFrame(lt)
df2

   0
0  1
1  2
2  a

In [51]:
df2.columns = ['자료']
df2

  자료
0  1
1  2
2  a

In [52]:
df2.dtypes

자료    object
dtype: object

In [66]:
df21 = df2.loc[1:2,:]
df21

    자료
1  2.0
2  NaN

In [56]:
df21['자료'] = pd.to_numeric(df21['자료'])
df21.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   자료      2 non-null      int64
dtypes: int64(1)
memory usage: 144.0 bytes

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [57]:
df2

  자료
0  1
1  2
2  a

In [58]:
df2['자료'] = pd.to_numeric(df2['자료'])
df2.dtypes

ValueError: ignored

In [59]:
df2['자료'] = pd.to_numeric(df2['자료'], errors='ignore')
df2

  자료
0  1
1  2
2  a

In [60]:
df2.dtypes

자료    object
dtype: object

In [61]:
df2['자료'] = pd.to_numeric(df2['자료'], errors='coerce' )
df2

    자료
0  1.0
1  2.0
2  NaN

In [62]:
df2.dtypes

자료    float64
dtype: object

+ pd.to_datetime(열명)
 - .dt.year : 년도
 - .dt.month : 월
 - .dt.day : 일

In [63]:
dfbusan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      30 non-null     object
 1   평균      30 non-null     float64
 2   최고      30 non-null     float64
 3   최저      30 non-null     float64
 4   차이      30 non-null     int64
dtypes: float64(3), int64(1), object(1)
memory usage: 1.3+ KB

In [64]:
dfbusan.head(2)

           일시   평균    최고   최저  차이
0  2017-01-01  4.1  15.1 -7.7  22
1  2017-02-01  5.5  17.7 -5.7  23

In [67]:
dfbusan['일시'] = pd.to_datetime(dfbusan['일시'])
dfbusan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      30 non-null     datetime64[ns]
 1   평균      30 non-null     float64
 2   최고      30 non-null     float64
 3   최저      30 non-null     float64
 4   차이      30 non-null     int64
dtypes: datetime64[ns](1), float64(3), int64(1)
memory usage: 1.3 KB

In [ ]:
dfbusan['일시'].dt.year

12    2018
13    2018
14    2018
15    2018
16    2018
17    2018
18    2018
19    2018
20    2018
21    2018
22    2018
23    2018
Name: 일시, dtype: int64

####**열 추가**

In [69]:
dfbusan['년도'] = dfbusan['일시'].dt.year
dfbusan['월'] = dfbusan['일시'].dt.month
dfbusan['일'] = dfbusan['일시'].dt.day
dfbusan.head(2)

          일시   평균    최고   최저  차이    년도  월  일
0 2017-01-01  4.1  15.1 -7.7  22  2017  1  1
1 2017-02-01  5.5  17.7 -5.7  23  2017  2  1

In [70]:
dfbusan[dfbusan['년도'] == 2018]

           일시    평균    최고    최저  차이    년도   월  일
12 2018-01-01   1.9  14.0  -9.9  23  2018   1  1
13 2018-02-01   3.9  14.7  -9.6  24  2018   2  1
14 2018-03-01  10.0  22.3  -0.7  23  2018   3  1
15 2018-04-01  14.5  24.3   3.0  21  2018   4  1
16 2018-05-01  17.8  26.6   9.8  16  2018   5  1
17 2018-06-01  21.5  31.3  15.1  16  2018   6  1
18 2018-07-01  26.7  35.4  17.8  17  2018   7  1
19 2018-08-01  27.9  36.4  21.2  15  2018   8  1
20 2018-09-01  21.9  30.0  14.9  15  2018   9  1
21 2018-10-01  16.4  25.6   7.9  17  2018  10  1
22 2018-11-01  12.4  22.5   2.7  19  2018  11  1
23 2018-12-01   5.7  18.8  -7.1  25  2018  12  1

In [ ]:
dfbusan['차이'] = dfbusan['최고'] - dfbusan['최저']
dfbusan

           일시    최고    최저    차이
12 2018-01-01  14.0  -9.9  23.9
13 2018-02-01  14.7  -9.6  24.3
14 2018-03-01  22.3  -0.7  23.0
15 2018-04-01  24.3   3.0  21.3
16 2018-05-01  26.6   9.8  16.8
17 2018-06-01  31.3  15.1  16.2
18 2018-07-01  35.4  17.8  17.6
19 2018-08-01  36.4  21.2  15.2
20 2018-09-01  30.0  14.9  15.1
21 2018-10-01  25.6   7.9  17.7
22 2018-11-01  22.5   2.7  19.8
23 2018-12-01  18.8  -7.1  25.9

In [79]:
dfbusan = dfbusan.drop('평균', axis=1)

In [80]:
dfbusan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   일시      30 non-null     datetime64[ns]
 1   최고      30 non-null     float64
 2   최저      30 non-null     float64
 3   차이      30 non-null     int64
 4   년도      30 non-null     int64
 5   월       30 non-null     int64
 6   일       30 non-null     int64
dtypes: datetime64[ns](1), float64(2), int64(4)
memory usage: 1.8 KB

In [83]:
dftemp = dfbusan

In [84]:
dftemp.mean()

최고      24.480000
최저       5.256667
차이      18.766667
년도    2017.800000
월        5.900000
일        1.000000
dtype: float64

In [72]:
dftemp['평균'] = dftemp.mean()
dftemp

           일시  평균    최고    최저  차이    년도   월  일
0  2017-01-01 NaN  15.1  -7.7  22  2017   1  1
1  2017-02-01 NaN  17.7  -5.7  23  2017   2  1
2  2017-03-01 NaN  18.1  -2.3  20  2017   3  1
3  2017-04-01 NaN  23.2   5.0  18  2017   4  1
4  2017-05-01 NaN  28.2  12.8  15  2017   5  1
5  2017-06-01 NaN  30.4  15.4  14  2017   6  1
6  2017-07-01 NaN  32.7  21.2  11  2017   7  1
7  2017-08-01 NaN  36.2  18.7  17  2017   8  1
8  2017-09-01 NaN  29.7  14.5  15  2017   9  1
9  2017-10-01 NaN  28.7   7.3  21  2017  10  1
10 2017-11-01 NaN  23.6  -1.0  24  2017  11  1
11 2017-12-01 NaN  14.5  -6.1  20  2017  12  1
12 2018-01-01 NaN  14.0  -9.9  23  2018   1  1
13 2018-02-01 NaN  14.7  -9.6  24  2018   2  1
14 2018-03-01 NaN  22.3  -0.7  23  2018   3  1
15 2018-04-01 NaN  24.3   3.0  21  2018   4  1
16 2018-05-01 NaN  26.6   9.8  16  2018   5  1
17 2018-06-01 NaN  31.3  15.1  16  2018   6  1
18 2018-07-01 NaN  35.4  17.8  17  2018   7  1
19 2018-08-01 NaN  36.4  21.2  15  2018   8  1
20 2018-09-01 NaN  30.0  14.9  15  2018   9  1
21 2018-10-01 NaN  25.6   7.9  17  2018  10  1
22 2018-11-01 NaN  22.5   2.7  19  2018  11  1
23 2018-12-01 NaN  18.8  -7.1  25  2018  12  1
24 2019-01-01 NaN  13.7  -4.4  18  2019   1  1
25 2019-02-01 NaN  16.5  -4.2  20  2019   2  1
26 2019-03-01 NaN  21.0   0.5  20  2019   3  1
27 2019-04-01 NaN  23.4   2.1  21  2019   4  1
28 2019-05-01 NaN  30.1  11.0  19  2019   5  1
29 2019-06-01 NaN  29.7  15.5  14  2019   6  1

In [85]:
dfbusan['평균'] = dfbusan[['최고','최저']].mean(axis=1)
dfbusan

           일시    최고    최저  차이    년도   월  일     평균
0  2017-01-01  15.1  -7.7  22  2017   1  1   3.70
1  2017-02-01  17.7  -5.7  23  2017   2  1   6.00
2  2017-03-01  18.1  -2.3  20  2017   3  1   7.90
3  2017-04-01  23.2   5.0  18  2017   4  1  14.10
4  2017-05-01  28.2  12.8  15  2017   5  1  20.50
5  2017-06-01  30.4  15.4  14  2017   6  1  22.90
6  2017-07-01  32.7  21.2  11  2017   7  1  26.95
7  2017-08-01  36.2  18.7  17  2017   8  1  27.45
8  2017-09-01  29.7  14.5  15  2017   9  1  22.10
9  2017-10-01  28.7   7.3  21  2017  10  1  18.00
10 2017-11-01  23.6  -1.0  24  2017  11  1  11.30
11 2017-12-01  14.5  -6.1  20  2017  12  1   4.20
12 2018-01-01  14.0  -9.9  23  2018   1  1   2.05
13 2018-02-01  14.7  -9.6  24  2018   2  1   2.55
14 2018-03-01  22.3  -0.7  23  2018   3  1  10.80
15 2018-04-01  24.3   3.0  21  2018   4  1  13.65
16 2018-05-01  26.6   9.8  16  2018   5  1  18.20
17 2018-06-01  31.3  15.1  16  2018   6  1  23.20
18 2018-07-01  35.4  17.8  17  2018   7  1  26.60
19 2018-08-01  36.4  21.2  15  2018   8  1  28.80
20 2018-09-01  30.0  14.9  15  2018   9  1  22.45
21 2018-10-01  25.6   7.9  17  2018  10  1  16.75
22 2018-11-01  22.5   2.7  19  2018  11  1  12.60
23 2018-12-01  18.8  -7.1  25  2018  12  1   5.85
24 2019-01-01  13.7  -4.4  18  2019   1  1   4.65
25 2019-02-01  16.5  -4.2  20  2019   2  1   6.15
26 2019-03-01  21.0   0.5  20  2019   3  1  10.75
27 2019-04-01  23.4   2.1  21  2019   4  1  12.75
28 2019-05-01  30.1  11.0  19  2019   5  1  20.55
29 2019-06-01  29.7  15.5  14  2019   6  1  22.60